import os
import sys
import django

# 把專案 root 加入 path
BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
sys.path.append(BASE_DIR)

# 指定 Django settings
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "Englishability.settings")

# 初始化 Django
django.setup()

from students.models import League
data = [
    ("海之鄉聯盟","國中","梓官國中"),
    ("海之鄉聯盟","國小","梓官國小"),
    ("海之鄉聯盟","國中","蚵寮國中"),
    ("海之鄉聯盟","國小","蚵寮國小"),
    ("海之鄉聯盟","國中","彌陀國中"),
    ("海之鄉聯盟","國小","彌陀國小"),
    ("海之鄉聯盟","國小","南安國小"),
    ("海之鄉聯盟","國小","壽齡國小"),
    ("海之鄉聯盟","國中","永安國中"),
    ("海之鄉聯盟","國小","永安國小"),
    ("海之鄉聯盟","國小","維新國小"),
    ("海之鄉聯盟","國小","新港國小"),
    ("海之鄉聯盟","國中","茄萣國中"),
    ("海之鄉聯盟","國小","茄萣國小"),
    ("海之鄉聯盟","國小","成功國小"),
    ("海之鄉聯盟","國小","興達國小"),
    ("海之鄉聯盟","國小","砂崙國小"),

    ("美濃書香鑽石聯盟","國中","美濃國中"),
    ("美濃書香鑽石聯盟","國小","美濃國小"),
    ("美濃書香鑽石聯盟","國小","福安國小"),
    ("美濃書香鑽石聯盟","國小","東門國小"),
    ("美濃書香鑽石聯盟","國中","南隆國中"),
    ("美濃書香鑽石聯盟","國小","中壇國小"),
    ("美濃書香鑽石聯盟","國小","吉洋國小"),
    ("美濃書香鑽石聯盟","國小","吉東國小"),
    ("美濃書香鑽石聯盟","國小","龍山國小"),
    ("美濃書香鑽石聯盟","國中","龍肚國中"),
    ("美濃書香鑽石聯盟","國小","龍肚國小"),
    ("美濃書香鑽石聯盟","國小","廣興國小"),

    ("郊區學校聯盟","國中","鳥松國中"),
    ("郊區學校聯盟","國小","鳥松國小"),
    ("郊區學校聯盟","國小","仁美國小"),
    ("郊區學校聯盟","國中","燕巢國中"),
    ("郊區學校聯盟","國小","燕巢國小"),
    ("郊區學校聯盟","國小","安招國小"),
    ("郊區學校聯盟","國小","鳳雄國小"),
    ("郊區學校聯盟","國小","金山國小"),
    ("郊區學校聯盟","國小","橫山國小"),
    ("郊區學校聯盟","國小","深水國小"),
    ("郊區學校聯盟","國中","興仁國中"),
    ("郊區學校聯盟","國小","前鎮國小"),
    ("郊區學校聯盟","國小","鎮昌國小"),
    ("郊區學校聯盟","國中","嘉興國中"),
    ("郊區學校聯盟","國小","嘉興國小"),
    ("郊區學校聯盟","國中","大樹國中"),
    ("郊區學校聯盟","國小","大樹國小"),
    ("郊區學校聯盟","國小","九曲國小"),
    ("郊區學校聯盟","國小","龍目國小"),
    ("郊區學校聯盟","國小","小坪國小"),
    ("郊區學校聯盟","國小","水寮國小"),
    ("郊區學校聯盟","國小","興田國小"),
    ("郊區學校聯盟","國中","大寮國中"),
    ("郊區學校聯盟","國小","永芳國小"),
    ("郊區學校聯盟","國小","忠義國小"),
    ("郊區學校聯盟","國小","大寮國小"),
    ("郊區學校聯盟","國小","山頂國小"),
    ("郊區學校聯盟","國中","大洲國中"),
    ("郊區學校聯盟","國小","溪州國小"),
    ("郊區學校聯盟","國小","嶺口國小"),
    ("郊區學校聯盟","國中","內門國中"),
    ("郊區學校聯盟","國小","內門國小"),
    ("郊區學校聯盟","國小","木柵國小"),
    ("郊區學校聯盟","國中","溪埔國中"),
    ("郊區學校聯盟","國小","溪埔國小"),
    ("郊區學校聯盟","國小","姑山國小"),
    ("郊區學校聯盟","國中","中庄國中"),
    ("郊區學校聯盟","國小","中庄國小"),
    ("郊區學校聯盟","國小","溪寮國小"),
    ("郊區學校聯盟","國小","後庄國小"),
    ("郊區學校聯盟","國中","立德國中"),
    ("郊區學校聯盟","國小","左營國小"),
    ("郊區學校聯盟","國小","明德國小"),
    ("郊區學校聯盟","國小","屏山國小"),
    ("郊區學校聯盟","國小","舊城國小"),

    ("山海學校聯盟","國中","忠孝國中"),
    ("山海學校聯盟","國中","潮寮國中"),
    ("山海學校聯盟","國小","潮寮國小"),
    ("山海學校聯盟","國小","昭明國小"),
    ("山海學校聯盟","國中","中芸國中"),
    ("山海學校聯盟","國小","中芸國小"),
    ("山海學校聯盟","國小","汕尾國小"),
    ("山海學校聯盟","國小","港埔國小"),
    ("山海學校聯盟","國中","那瑪夏國中"),
    ("山海學校聯盟","國小","民權國小"),
    ("山海學校聯盟","國小","民生國小"),
    ("山海學校聯盟","國中","甲仙國中"),
    ("山海學校聯盟","國小","甲仙國小"),
    ("山海學校聯盟","國小","小林國小"),
    ("山海學校聯盟","國中","杉林國中"),
    ("山海學校聯盟","國小","杉林國小"),
    ("山海學校聯盟","國小","月美國小"),
    ("山海學校聯盟","國小","新庄國小"),
    ("山海學校聯盟","國小","上平國小"),
    ("山海學校聯盟","國中","圓富國中"),
    ("山海學校聯盟","國小","圓潭國小"),
    ("山海學校聯盟","國小","金竹國小"),
    ("山海學校聯盟","國小","溝坪國小"),
    ("山海學校聯盟","國中","巴楠花部落中小學"),
    ("山海學校聯盟","國中","六龜高中國中部"),
    ("山海學校聯盟","國小","六龜國小"),
    ("山海學校聯盟","國小","龍興國小"),
    ("山海學校聯盟","國小","新發國小"),
    ("山海學校聯盟","國小","荖濃國小"),
    ("山海學校聯盟","國中","寶來國中"),
    ("山海學校聯盟","國小","寶來國小"),
    ("山海學校聯盟","國中","桃源國中"),
    ("山海學校聯盟","國小","寶山國小"),
    ("山海學校聯盟","國小","建山國小"),
    ("山海學校聯盟","國小","興中國小"),
    ("山海學校聯盟","國小","桃源國小"),
    ("山海學校聯盟","國小","樟山國小"),
    ("山海學校聯盟","國中","茂林國中"),
    ("山海學校聯盟","國小","茂林國小"),
    ("山海學校聯盟","國小","多納國小"),
    ("山海學校聯盟","國中","林園高中國中部"),
    ("山海學校聯盟","國小","林園國小"),
    ("山海學校聯盟","國小","王公國小"),
    ("山海學校聯盟","國小","金潭國小"),
    ("山海學校聯盟","國中","鳳林國中"),
    ("山海學校聯盟","國小","鳳林國小"),
    ("山海學校聯盟","國小","鳳鳴國小"),
]

created = 0

for league_name, school_type, school_name in data:
    _, is_created = League.objects.get_or_create(
        league_name=league_name,
        school_type=school_type,
        school_name=school_name,
        defaults={"convener": ""}
    )

    if is_created:
        created += 1